[Killed] StringLiteral
main/components/Articles/ArticleTable.js:63:20
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "ArticleTable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticleTable"),
+      ButtonColumn("", "danger", deleteCallback, "ArticleTable"),
     );
   }
killedBy: ArticleTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
