[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:76:26
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
-                pattern: {
-                  value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-                  message: "Invalid email address format.",
-                },
+                pattern: {},
               })}
             />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Invalid email address format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:77:26
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
                 pattern: {
-                  value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
+                  value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[^A-Z]{2,}$/i,
                   message: "Invalid email address format.",
                 },

[Survived] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:77:26
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
                 pattern: {
-                  value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
+                  value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]$/i,
                   message: "Invalid email address format.",
                 },

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:96:37
               id="stars"
               type="number"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
-                required: "Stars rating is required.",
-                min: { value: 1, message: "Stars must be at least 1." },
-                max: { value: 5, message: "Stars must be at most 5." },
-                valueAsNumber: true,
-              })}
+              {...register("stars", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars rating is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:100:32
                 required: "Stars rating is required.",
                 min: { value: 1, message: "Stars must be at least 1." },
                 max: { value: 5, message: "Stars must be at most 5." },
-                valueAsNumber: true,
+                valueAsNumber: false,
               })}
             />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:144:28
               as="textarea"
               rows={3}
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", { required: "Comments are required." })}
+              {...register("", { required: "Comments are required." })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
