[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:45:15
       accessor: "itemId",
     },
     {
-      Header: "Reviewer Email",
+      Header: "",
       accessor: "reviewerEmail",
     },
killedBy: MenuItemReviewTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Reviewer Email"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:48:5
       Header: "Reviewer Email",
       accessor: "reviewerEmail",
     },
-    {
-      Header: "Stars",
-      accessor: "stars",
-    },
+    {},
     {
       Header: "Date Reviewed",
killedBy: MenuItemReviewTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
