[Killed] ArrowFunction
src/main/utils/menuItemReviewUtils.js:1:40
-export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/menuitemreview",
-  method: "DELETE",
-  params: {
-    id: cell.row.values.id,
-  },
-});
+export const cellToAxiosParamsDelete = () => undefined;
 
 export const onDeleteSuccess = (response) => {
killedBy: menuItemReviewUtils cellToAxiosParamsDelete should return the correct axios params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 1}, "url": "/api/menuitemreview"}
Received: undefined

[Killed] StringLiteral
src/main/utils/menuItemReviewUtils.js:2:8
 export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/menuitemreview",
+  url: "",
   method: "DELETE",
   params: {
killedBy: menuItemReviewUtils cellToAxiosParamsDelete should return the correct axios params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] BlockStatement
src/main/utils/menuItemReviewUtils.js:9:46
   },
 });
 
-export const onDeleteSuccess = (response) => {
-  // For now, just return the response
-  return response;
-};
+export const onDeleteSuccess = (response) => {};
 
killedBy: menuItemReviewUtils onDeleteSuccess should return the response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Success"}
Received: undefined
