[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:63:39
           OrgTranslationShort
         </Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-orgtranslationshort"}
+          data-testid={testIdPrefix + ""}
           id="orgtranslationshort"
           type="text"
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgtranslationshort"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:83:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="orgtranslation">OrgTranslation</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-orgtranslation"}
+          data-testid={testIdPrefix + ""}
           id="orgtranslation"
           type="text"
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgtranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
