[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:45:17
 
     {
       Header: "OrgCode",
-      accessor: "orgCode",
+      accessor: "",
     },
     {
killedBy: UCSBOrganizationIndexPage tests renders three UCSB Organizations correctly for regular user
statusReason: TestingLibraryElementError: Unable to find an element with the text: SKY. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:47:5
       Header: "OrgCode",
       accessor: "orgCode",
     },
-    {
-      Header: "OrgTranslationShort",
-      accessor: "orgTranslationShort",
-    },
+    {},
     {
       Header: "OrgTranslation",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
