[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationIndexPage.js:30:27
         <Button
           variant="primary"
           href="/ucsborganizations/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create UCSB Organization
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
